{
  "basics": {
    "name": "Yike (Eric) Tan",
    "label": "Software Engineer",
    "image": "",
    "email": "yiketn@gmail.com",
    "phone": "+1-412-583-0350",
    "url": "http://likegiver.github.io",
    "summary": "Graduate student at Carnegie Mellon University specializing in Artificial Intelligence Engineering - Information Security with expertise in AI systems, full-stack development, and scalable software solutions.",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "Pittsburgh",
      "countryCode": "US",
      "region": "Pennsylvania"
    },
    "profiles": []
  },
  "work": [
    {
      "name": "Instance Creator LLC",
      "position": "Software Engineer Intern",
      "url": "",
      "startDate": "2025-05-01",
      "endDate": "2025-07-31",
      "summary": "Developed advanced automation systems and semantic matching platforms for streamlining application workflows.",
      "highlights": [
        "Spearheaded a vector-based semantic matching system using Qdrant, boosting matching accuracy to over 80%.",
        "Developed a multi-agent automation platform with AutoGen and gpt-4o to orchestrate complex application workflows, reducing manual effort by 85%.",
        "Designed and implemented a scalable microservices backend using async FastAPI to support over 1,000 concurrent users; optimized performance by introducing a Redis caching layer, reducing external API latency and call frequency by 80%."
      ]
    },
    {
      "name": "Epoching AI",
      "position": "Software Engineer Intern",
      "url": "",
      "startDate": "2024-07-01",
      "endDate": "2024-08-31",
      "summary": "Enhanced AI model performance and deployed scalable watermark removal services.",
      "highlights": [
        "Achieved a 10x inference speedup and 30% accuracy boost for a watermark removal service using NVIDIA TensorRT.",
        "Developed a data generation and augmentation pipeline, improving model robustness against semi-transparent watermarks.",
        "Containerized the service using Docker and deployed it on Cloud ECS, implementing Prometheus for real-time monitoring and ensuring high availability to handle 500+ concurrent requests."
      ]
    },
    {
      "name": "Ytell Network Technology Co., Ltd.",
      "position": "Software Engineer Intern",
      "url": "",
      "startDate": "2023-09-01",
      "endDate": "2024-03-31",
      "summary": "Built high-performance multimodal systems and automated data processing pipelines.",
      "highlights": [
        "Developed a high-performance multimodal RAG chatbot with FastAPI, increasing inference throughput by 5x using Flash Attention 2 and cutting retrieval errors by 40% through a hybrid search strategy.",
        "Automated the processing of 1,000+ daily orders with a data pipeline using Apache Airflow and MongoDB, eliminating over 5 hours of weekly manual work for each store manager."
      ]
    }
  ],
  "education": [
    {
      "institution": "Carnegie Mellon University",
      "location": "Pittsburgh, PA",
      "url": "",
      "area": "Artificial Intelligence Engineering - Information Security",
      "studyType": "Master of Science",
      "startDate": "2023-08-01",
      "endDate": "2025-12-01",
      "score": "3.78/4.00",
      "courses": ["LLM Systems", "LLM Methods and Applications", "AI Systems and Tool Chains", "Computer Systems"]
    },
    {
      "institution": "University of International Business and Economics",
      "location": "Beijing, China",
      "url": "",
      "area": "Data Science and Big Data Technology",
      "studyType": "Bachelor of Engineering",
      "startDate": "2020-08-01",
      "endDate": "2024-07-01",
      "score": "3.70/4.00",
      "courses": ["Operation Systems", "Data Structure and Algorithm", "Natural Language Processing", "Big Data Analysis"]
    }
  ],
  "projects": [
    {
      "name": "ImaginAItion: AI Literacy Game",
      "summary": "Engineered a real-time multiplayer AI literacy game with React (TypeScript) frontend and FastAPI backend for CMU HCI.",
      "highlights": [
        "Leveraged Socket.IO over WebSockets to ensure low-latency (<150ms) state synchronization for 50+ concurrent players.",
        "Implemented a stateful backend game loop to manage turn-based player progression, integrating the gpt-image-1 API for real-time, dynamic image generation.",
        "Orchestrated the full-stack application with Docker Compose for reproducible local development and deployed the containerized services to Amazon ECS for a scalable production environment."
      ],
      "startDate": "2025-07-01",
      "endDate": "2025-08-31",
      "url": ""
    },
    {
      "name": "Silent Supporter: Scalable AI Multimodal Therapy Platform",
      "summary": "Built a scalable therapy platform on a Node.js backend for Tsinghua AIR with advanced AI capabilities.",
      "highlights": [
        "Reduced real-time generation latency by 80% via WebSockets; utilized PostgreSQL for primary data storage and Redis for session caching to improve performance.",
        "Achieved targeted music style transfer by fine-tuning the InspireMusic 1.5B model on a custom-built dataset, and developed a WebGL engine to dynamically visualize conversational emotion in real-time.",
        "Designed a low-latency, event-driven architecture using RabbitMQ for asynchronous, non-blocking multimodal generation; separately optimized the core AI model's inference speed by 3x through ONNX Runtime graph optimization."
      ],
      "startDate": "2025-06-01",
      "endDate": "2025-08-31",
      "url": ""
    },
    {
      "name": "MovieRec – End-to-End Recommendation System",
      "summary": "Architected a full-stack recommendation platform with comprehensive MLOps workflow.",
      "highlights": [
        "Integrated a Vue.js frontend with a backend based on Flask API and SpringBoot; Leveraged MySQL and Redis to handle the data persistence layer.",
        "Trained Random Forest model using Scikit-learn, conducted offline evaluation with train-validation splits and online evaluation with telemetry data to assess model performance; managed A/B testing experiments with MLflow.",
        "Established a containerized MLOps workflow, simulating a high-availability architecture with Minikube and implementing a Jenkins CI/CD pipeline with Prometheus/Grafana for automated deployment and real-time monitoring."
      ],
      "startDate": "2025-02-01",
      "endDate": "2025-03-31",
      "url": ""
    },
    {
      "name": "Self-LLM: Open-Source LLM Deployment Guide",
      "summary": "Co-authored and maintained a leading open-source guide simplifying LLM deployment with 23.2k GitHub stars.",
      "highlights": [
        "Led to feature in the keynote presentation at Google I/O Connect China 2024.",
        "As a core contributor, authored key tutorials on GLM4 deployment with vLLM, LangChain integration, and LoRA fine-tuning to simplify the learning curve for developers."
      ],
      "startDate": "2024-05-01",
      "endDate": "2024-06-30",
      "url": ""
    }
  ],
  "skills": [
    {
      "name": "Programming Languages",
      "level": "",
      "icon": "",
      "keywords": ["Python", "C", "CUDA", "C++", "Java", "JavaScript", "SQL", "R"]
    },
    {
      "name": "Packages and Frameworks",
      "level": "",
      "icon": "",
      "keywords": ["PyTorch", "TensorFlow", "Triton", "Jax", "SparkML", "NumPy", "Pandas", "React", "Node.js", "Django", "Flask"]
    },
    {
      "name": "Tools",
      "level": "",
      "icon": "",
      "keywords": ["Git", "Docker", "Kubernetes", "Kafka", "Neo4j", "Amazon Web Service", "Google Cloud Platform", "Unix", "LaTeX"]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Fluent",
      "icon": ""
    },
    {
      "language": "Chinese",
      "fluency": "Native",
      "icon": ""
    }
  ],
  "references": [],
  "certificates": [],
  "publications": [],
  "awards": []
}